# HAreaN

## Description
Compute the area of a given object, it has the same function as HArea(), but the result in case of polyline is more accurate.

```pascal
FUNCTION HAreaN(ObjectHandle : HANDLE): REAL;
```

```python
def vs.HAreaN(ObjectHandle):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ObjectHandle|HANDLE|It is the object we want to calculate its area.|

## Examples
```pascal
HAreaN(object);
```

```pascal
perim := HPerimN (objH);
area  := HAreaN  (objH);
```
```python
import vs

# Compute the area of a given object, it has the same function as HArea(),
# but the result in case of polyline is more accurate.
ObjectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer

area = vs.HAreaN(ObjectHandle)
vs.Message('HAreaN returned: ' + str(area))
```
See also in tutorials: 22. Selected Objects → Worksheet Rows, 25. Geometric Property Extraction Table, 29. Cross-Layer Summary, 30. Publish Worksheet Image on a Sheet Layer

## Version
Availability: from Vectorworks 2012
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Object Info